docs/leets-lua/1652-Defuse-the-Bomb.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-11-18 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>1652. Defuse the Bomb</title>
<meta name="author" content="d)zharii" />
<meta name="generator" content="Org Mode" />
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<link rel="stylesheet" href="/static/t.css"/>
</head>
<body>
<nav><a href="/" tabindex="0">&larrhk; Back to Index</a></nav><div id="preamble" class="status">
Published 2024-11-18
</div>
<div id="content" class="content">
<header>
<h1 class="title">1652. Defuse the Bomb</h1>
<p class="subtitle" role="doc-subtitle">leetcode</p>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org66dd824">Problem Restatement</a></li>
<li><a href="#org539e6df">Solution Description</a></li>
<li><a href="#orgef39bda">Example</a></li>
<li><a href="#orge328bdf">References</a></li>
<li><a href="#orge474fd3">Solution Code</a></li>
</ul>
</div>
</nav>

<div id="outline-container-org66dd824" class="outline-2">
<h2 id="org66dd824">Problem Restatement</h2>
<div class="outline-text-2" id="text-org66dd824">
<p>
Given an array called <code>code</code> where each element represents a part of a bomb and an integer <code>k</code>, we need to create a new array of the same size where each element at index <code>i</code> is the sum of the next <code>k</code> elements from the original array in circular fashion. If <code>k</code> is zero, the new array should be filled with zeros. If <code>k</code> is negative, it should sum up the previous <code>|k|</code> elements in a circular fashion.
</p>
</div>
</div>

<div id="outline-container-org539e6df" class="outline-2">
<h2 id="org539e6df">Solution Description</h2>
<div class="outline-text-2" id="text-org539e6df">
<p>
To implement the solution, we will consider different cases based on the value of <code>k</code>:
</p>

<ol class="org-ol">
<li>If <code>k</code> is zero, fill the resulting array with zeros.</li>
<li>If <code>k</code> is positive, calculate the sum of the next <code>k</code> elements using modulo to handle wrapping.</li>
<li>If <code>k</code> is negative, compute the sum of the previous <code>|k|</code> elements using modulo.</li>
</ol>

<p>
We need to precompute cumulative sums to optimize window slicing operations. Using modular arithmetic allows efficient handling of circular indexing.
</p>

<p>
Time Complexity: <code>O(n), where ~n</code> is the length of the array, due to single pass summation.
Space Complexity: <code>O(n), as we are creating a new array of length ~n</code>.
</p>
</div>
</div>

<div id="outline-container-orgef39bda" class="outline-2">
<h2 id="orgef39bda">Example</h2>
<div class="outline-text-2" id="text-orgef39bda">
<p>
Consider the array <code>code = {5, 7, 1, 4}</code> and <code>k = 3</code>:
</p>

<ul class="org-ul">
<li>For index <code>0</code>, sum the next <code>3</code> elements: <code>7 + 1 + 4 = 12</code>.</li>
<li>For index <code>1</code>, loop around for the sum: <code>1 + 4 + 5 = 10</code>.</li>
<li>For index <code>2</code>, loop around for the sum: <code>4 + 5 + 7 = 16</code>.</li>
<li>For index <code>3</code>, loop around for the sum: <code>5 + 7 + 1 = 13</code>.</li>
</ul>

<p>
The resulting array is <code>{12, 10, 16, 13}</code>.
</p>
</div>
</div>

<div id="outline-container-orge328bdf" class="outline-2">
<h2 id="orge328bdf">References</h2>
<div class="outline-text-2" id="text-orge328bdf">
<ul class="org-ul">
<li>Circular Array Traversal: <a href="https://en.wikipedia.org/wiki/Circular_buffer">https://en.wikipedia.org/wiki/Circular_buffer</a></li>
</ul>
</div>
</div>

<div id="outline-container-orge474fd3" class="outline-2">
<h2 id="orge474fd3">Solution Code</h2>
<div class="outline-text-2" id="text-orge474fd3">
<div class="org-src-container">
<pre class="src src-lua">-- Defuse the Bomb solution in Lua

function defuseBomb(code, k)
  local codeLen = #code
  local result = {}

  print("")

  if k == 0 then
    for i = 1, codeLen do result[i] = 0 end
    return result
  end

  if codeLen == 1 then
    return code
  end

  local moves = math.abs(k)
  moves = math.min(codeLen - 1, moves)

  for i = 1, codeLen do
    if k &gt; 0 then
      local sum = 0;
      for m =1,moves  do
        local idx = ((i + m - 1) % codeLen) + 1
        sum = sum + code[idx]
        -- print("i = ", i, "; k =", k, "; idx=", idx, "; code[idx]=", code[idx], "; m=", m)
      end
      result[i] = sum
    else
      local sum = 0;
      for m =1,moves  do
        local idx = ((i - m - 1 + codeLen) % codeLen) + 1
        sum = sum + code[idx]
        -- print("i = ", i, "; k =", k, "; idx=", idx, "; code[idx]=", code[idx], "; m=", m)
      end
      result[i] = sum
    end
  end

  return result
end

-- Test helper

function assertEqualArrays(a, b)
  if #a ~= #b then
    error("Arrays are not equal in length")
  end
  for i = 1, #a do
    if a[i] ~= b[i] then
      error("Arrays differ at position "..i..": "..a[i].." ~= "..b[i])
    end
  end
end

-- Test cases

local tests = {
  {
    title = "Test 1: Simple case",
    test = function()
      local code = {5, 7, 1, 4}
      local k = 3
      local expected = {12, 10, 16, 13}
      local result = defuseBomb(code, k)
      assertEqualArrays(result, expected)
    end
  },
  {
    title = "Test 2: Negative k",
    test = function()
      local code = {2, 4, 9, 3}
      local k = -2
      local expected = {12, 5, 6, 13}
      local result = defuseBomb(code, k)
      assertEqualArrays(result, expected)
    end
  },
  {
    title = "Test 3: Zero k",
    test = function()
      local code = {10, 5, 7, 8}
      local k = 0
      local expected = {0, 0, 0, 0}
      local result = defuseBomb(code, k)
      assertEqualArrays(result, expected)
    end
  },
  {
    title = "Test 4: Large k",
    test = function()
      local code = {1, 2, 3, 4}
      local k = 100
      local expected = {9, 8, 7, 6}
      local result = defuseBomb(code, k)
      assertEqualArrays(result, expected)
    end
  },
  {
    title = "Test 5: Single element array",
    test = function()
      local code = {6}
      local k = 1
      local expected = {6}
      local result = defuseBomb(code, k)
      assertEqualArrays(result, expected)
    end
  }
}

-- Test runner

function runTests(tests)
  local passed = 0
  local failed = 0
  for _, testCase in ipairs(tests) do
    io.write(testCase.title .. " ... ")
    local status, err = pcall(testCase.test)
    if status then
      print("Passed")
      passed = passed + 1
    else
      print("Failed: " .. err)
      failed = failed + 1
    end
  end
  print("\nSummary:")
  print("Passed: "..passed)
  print("Failed: "..failed)
end

runTests(tests)
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
&copy; d)zharii. <a href="/sitemap.html">sitemap</a>
</div>
</body>
</html>
